/*
 encapsulation(инкапcуляция) - сокрытие данных, защита их от нежелательного внешнего вмешательства,
 помещение их в "капсулу". она не означает , что мы не сможем видеть эти данные или пользоваться ими
 нет, она означает, что мы скрываем их от какого либо внешнего воздействия. Нпример банкомат: мы не 
 можем изменить баланс просто так напрямую, мы можем это сделать либо пополнив баланс или сняв деньги. 
 */
package lesson22_encapsulation_super_protected;

/**
 *
 * @author User
 */
public class Encapsulation {
    
}
