
package lesson20;


public class Collections {
    /* есть interface Collections - у него есть несколько главных детей:интерфейс: List(список)
                                                                                   Set(множество)
                                                                                   Queue(очередь)
                                и особничком стоит                                 Map(карта)
    
    Коллекция вообще это набор каких то элементов, набор чего-то
    
    Интерфейс лист реализует несколько конкретных классов, один из который 
    
    ArrayList:  в основе лежит массив, лист поддерживает индексацию, при добавлении определнный порядок,
    элементы могут повторяться
    
    LinkedList(связанный лист) - каждый элемент знает своего соседа
    
    
    
    */                                                                                
                                                                                
}
